app/Models/JenisModel.php

SELECT *
FROM `tbl_jenis`
WHERE `id` = '1'
 LIMIT 1
---
        public function getJenis($jenis){
            return $this->where(['id' => $jenis])->first();