app/Models/KomikModel.php

        public function getAll(){
            return $this->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `tbl_komik`
ORDER BY `created_at` DESC

        public function getManga(){
            return $this->where(['jenis' => '1'])->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `tbl_komik`
WHERE `jenis` = '1'
ORDER BY `created_at` DESC

        public function getNovel(){
            return $this->where(['jenis' => '2'])->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `tbl_komik`
WHERE `jenis` = '2'
ORDER BY `created_at` DESC

        public function getKomik($slug = false){
            return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `tbl_komik`
WHERE `slug` = 'one-piece-volume-3'
 LIMIT 1

        public function getJenis($slug = false){
            return $this->where(['jenis' => $slug])->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `tbl_komik`
WHERE `jenis` = '2'
ORDER BY `id` DESC