app/Models/UserModel.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'Admin@gmail.com'
 LIMIT 1
---
        public function getUser(){
            return $this->where(['username' => 'Admin@gmail.com' ])->first();

SELECT *
FROM `tbl_user`
WHERE `username` = 'Admin@gmail.com'
 LIMIT 1
---
        public function getUnik($email){
            return $this->where(['username' => $email ])->first();